import React from "react";

export class UserAgreement extends React.Component {

  render() {
    return <div>
      <h2>Пользовательское соглашение</h2><br/>
      Галкина Евгения Вадимовна, в лице интернет-магазина nw-cards.ru "North Wind Cards" (далее ПРОДАВЕЦ), публикует настоящий договор, являющийся публичным договором-офертой в адрес как физических, так и юридических лиц (далее ПОКУПАТЕЛЬ) о нижеследующем:<br/>
      <br/><strong>1. Предмет договора-оферты</strong><br/><br/>
      1.1. ПРОДАВЕЦ обязуется передать в собственность ПОКУПАТЕЛЮ, а ПОКУПАТЕЛЬ обязуется оплатить и принять заказанные в интернет-магазине nw-cards.ru "North Wind Cards"- товары (далее ТОВАР).<br/>
      <br/><strong>2. Момент заключения договора</strong><br/><br/>
      2.1. Текст данного Договора является публичной офертой (в соответствии со статьей 435 и частью 2 статьи 437 Гражданского кодекса РФ).<br/>
      2.2. Факт оформления ЗАКАЗА ТОВАРА у ПРОДАВЦА как самостоятельно, так и через оператора, является безоговорочным принятием данного Договора, и ПОКУПАТЕЛЬ рассматривается как лицо, вступившее с ПРОДАВЦОМ в договорные отношения.<br/>
      2.3. Оформление ЗАКАЗА ТОВАРА и расчета осуществляется путем заказа ПОКУПАТЕЛЕМ в интернет-магазине nw-cards.ru "North Wind Cards"<br/>
      <br/><strong>3. Цена ТОВАРА</strong><br/><br/>
      3.1. Цены в интернет-магазине указаны в российских рублях покупателя за единицу ТОВАРА.<br/>
      3.2. Тарифы на оказание услуг по доставке ТОВАРА указаны в интернет-магазине отдельно на каждый способ доставки.<br/>
      3.3. Общая сумма ЗАКАЗА, которая в некоторых случаях может включать платную доставку, указывается в разделе «Корзина» в строке «Итого».<br/>
      <br/><strong>4. Оплата ТОВАРА</strong><br/><br/>
      4.1. При наличной форме оплаты ПОКУПАТЕЛЬ обязан уплатить ПРОДАВЦУ цену ТОВАРА в момент его передачи, а ПРОДАВЕЦ обязан предоставить ПОКУПАТЕЛЮ кассовый или товарный чек, или иной документ, подтверждающий оплату ТОВАРА.<br/>
      4.2. При безналичной форме оплаты обязанность ПОКУПАТЕЛЯ по уплате цены ТОВАРА считается исполненной с момента списания денежных средств в размере 100% (ста процентов) предоплаты с расчетного счета ПОКУПАТЕЛЯ в банке, кредитной организации, оказывающей в соответствии с действующим законодательством Российской Федерации платежные услуги населению, в том числе с использованием электронных денежных средств.<br/>
      4.3. При безналичной форме оплаты просрочка уплаты ПОКУПАТЕЛЕМ цены ТОВАРА на срок свыше  3 (трех) дней является существенным нарушением настоящего договора. В этом случае ПРОДАВЕЦ вправе в одностороннем порядке отказаться от исполнения настоящего договора, уведомив об этом ПОКУПАТЕЛЯ.<br/>
      4.4. ТОВАРЫ поставляются ПОКУПАТЕЛЮ по ценам, наименованию, в количестве, соответствующем счету, оплаченному ПОКУПАТЕЛЕМ.<br/>
      <br/><strong>5. Доставка ТОВАРА</strong><br/><br/>
      5.1. Доставка ТОВАРА ПОКУПАТЕЛЮ осуществляется по адресу, указанному ПОКУПАТЕЛЕМ при оформлении ЗАКАЗА. Отправка ТОВАРА осуществляется в течение 5 рабочих дней, следующих за днём оплаты ТОВАРА покупателем.<br/>
      5.2. Точная стоимость доставки ТОВАРА определяется менеджером ПРОДАВЦА при оформлении заказа и не может быть изменена после согласования ПОКУПАТЕЛЕМ.<br/>
      5.3. Неявка ПОКУПАТЕЛЯ или не совершение иных необходимых действий для принятия ТОВАРА могут рассматриваться ПРОДАВЦОМ в качестве отказа ПОКУПАТЕЛЯ от исполнения ДОГОВОРА.<br/>
      <br/><strong>6. Гарантии на ТОВАР</strong><br/><br/>
      6.1. На всю продукцию, продающуюся в Интернет-магазине nw-cards.ru "North Wind Cards" имеются все необходимые сертификаты качества и санитарно-гигиенические заключения, если товар подразумевает наличие таких документов.<br/>
      6.2. Гарантийный срок эксплуатации на технически сложный ТОВАР устанавливает производитель. Срок гарантии указывается в гарантийном талоне.<br/>
      <br/><strong>7. Права и обязанности сторон</strong><br/><br/>
      7.1. ПРОДАВЕЦ обязуется:<br/>
      7.1.1. До заключения договора предоставить ПОКУПАТЕЛЮ информацию об основных потребительских свойствах ТОВАРА, об адресе (месте нахождения) ПРОДАВЦА, о месте изготовления ТОВАРА, о полном фирменном наименовании (наименовании) ПРОДАВЦА, о цене и об условиях приобретения ТОВАРА, о его доставке, сроке службы, сроке годности и гарантийном сроке, о порядке оплаты ТОВАРА, а также о сроке, в течение которого действует предложение о заключении Договора.<br/>
      7.1.2. Не разглашать любую частную информацию ПОКУПАТЕЛЯ и не предоставлять доступ к этой информации третьим лицам, за исключением случаев, предусмотренных Российским законодательством.<br/>
      7.1.3. Предоставить ПОКУПАТЕЛЮ возможность получения бесплатных консультаций по электронному адресу northwindcards@gmail.com. Объем консультаций ограничивается конкретными вопросами, связанными с выполнениями ЗАКАЗА.<br/>
      7.1.4. ПРОДАВЕЦ оставляет за собой право изменять настоящий ДОГОВОР в одностороннем порядке до момента его заключения.<br/>
      7.1.5. Предоставить Потребителю в момент доставки товара в письменной форме информацию о товаре, предусмотренную статьей 10 Федерального закона «О защите прав потребителей», а также предусмотренную пунктом 10 настоящего Договора информацию о порядке и сроках возврата товара.<br/>
      7.2. ПОКУПАТЕЛЬ обязуется:<br/>
      7.2.1. До момента заключения ДОГОВОРА ознакомиться с содержанием договора-оферты, условиями оплаты и доставки на сайте магазина nw-cards.ru<br/>
      7.2.2. Предоставлять достоверную информацию о себе (ФИО, контактные телефоны, адрес электронной почты) и реквизиты для доставки ТОВАРА.<br/>
      7.2.3. Принять и оплатить ТОВАР в указанные в настоящем ДОГОВОРЕ сроки.<br/>
      <br/><strong>8. Ответственность сторон и разрешение споров</strong><br/><br/>
      8.1. Стороны несут ответственность за неисполнение или ненадлежащее исполнение настоящего ДОГОВОРА в порядке, предусмотренном настоящим ДОГОВОРОМ и действующим законодательством РФ.<br/>
      8.2. Продавец не несет ответственности за доставку ЗАКАЗА, если ПОКУПАТЕЛЕМ указан неправильный адрес доставки.<br/>
      8.3. ПРОДАВЕЦ не несет ответственности, если ожидания ПОКУПАТЕЛЯ о потребительских свойствах ТОВАРА оказались не оправданы.<br/>
      8.4. ПРОДАВЕЦ не несет ответственности за частичное или полное неисполнение обязательств по доставке ТОВАРА, если они являются следствием форс-мажорных обстоятельств.<br/>
      8.5. ПОКУПАТЕЛЬ, оформляя ЗАКАЗ, несет ответственность за достоверность предоставляемой информации о себе, а также подтверждает, что с условиями настоящего ДОГОВОРА ознакомлен и согласен.<br/>
      8.6. Все споры и разногласия, возникающие при исполнении СТОРОНАМИ обязательств по настоящему Договору, решаются путем переговоров. В случае невозможности их устранения, СТОРОНЫ имеют право обратиться за судебной защитой своих интересов.<br/>
      <br/><strong>9. Возврат и обмен товара</strong><br/><br/>
      9.1. Требование ПОКУПАТЕЛЯ об обмене либо о возврате ТОВАРА подлежит удовлетворению, если ТОВАР не был в употреблении, сохранены его потребительские свойства, сохранена и не нарушена упаковка, сохранены документы, подтверждающие факт покупки этого ТОВАРА в интернет-магазине nw-cards.ru "North Wind Cards"<br/>
      9.2. Срок такого требования составляет 7 (семь) дней с момента передачи ТОВАРА ПОКУПАТЕЛЮ, либо в любое время до передачи ТОВАРА ПОКУПАТЕЛЮ.<br/>
      9.3. ПОКУПАТЕЛЬ компенсирует ПРОДАВЦУ необходимые транспортные расходы, понесенные в связи с организацией обмена или возврата ТОВАРА.<br/>
      <br/><strong>10. Форс-мажорные обстоятельства</strong><br/><br/>
      10.1. Стороны освобождаются от ответственности за неисполнение или ненадлежащее исполнение обязательств по Договору на время действия непреодолимой силы. Под непреодолимой силой понимаются чрезвычайные и непреодолимые при данных условиях обстоятельства, препятствующие исполнению своих обязательств СТОРОНАМИ по настоящему Договору. К ним относятся стихийные явления (землетрясения, наводнения и т. п.), обстоятельства общественной жизни (военные действия, чрезвычайные положения, крупнейшие забастовки, эпидемии и т. п.), запретительные меры государственных органов (запрещение перевозок, валютные ограничения, международные санкции запрета на торговлю и т. п.). В течение этого времени СТОРОНЫ не имеют взаимных претензий, и каждая из СТОРОН принимает на себя свой риск последствия форс-мажорных обстоятельств.<br/>
      <br/><strong>11. Срок действия договора</strong><br/><br/>
      11.1. Настоящий ДОГОВОР вступает в силу с момента обращения к ПРОДАВЦУ и оформления ЗАКАЗА, и заканчивается при полном исполнении обязательств СТОРОНАМИ.<br/>
      <br/><strong>12. Персональные данные</strong><br/><br/>
      12.1. ПРОДАВЕЦ собирает и обрабатывает персональные данные ПОКУПАТЕЛЕЙ (а именно: фамилия, имя, отчество ПОКУПАТЕЛЯ; адрес доставки; контактный телефон) в целях:<br/>
      - выполнения условий настоящего Договора;<br/>
      - доставки Покупателю заказанного Товара.<br/>
      12.2. Осуществляя ЗАКАЗ ТОВАРА в интернет-магазине nw-cards.ru "North Wind Cards" ПОКУПАТЕЛЬ дает согласие на сбор и обработку персональных данных о себе в целях осуществления доставки заказанного ТОВАРА и исполнения условий настоящего ДОГОВОРА.<br/>
      12.3. При сборе и обработке персональных данных ПОКУПАТЕЛЕЙ, ПРОДАВЕЦ не преследует иных целей, кроме установленных в п.12.1 настоящего ДОГОВОРА.<br/>
      12.4. Доступ к персональным данным ПОКУПАТЕЛЕЙ имеют только лица, имеющие непосредственное отношение к исполнению ЗАКАЗОВ.<br/>
      <br/><strong>Конфеденциальность</strong><br/><br/>
      Настоящая политика конфиденциальности определяет, что Сайт получает ваши личные данные, в том числе контактные и персональные данные. Данные обрабатываются исключительно для исполнения вашего поручения. Сайт может собирать и обрабатывать данные о Пользователе, которую Пользователь предоставляет через сервисы и формы на Сайте. Использование данных осуществляется с вашего разрешения.<br/>
      <br/><strong>Персональные данные</strong><br/><br/>
      Сайт принимает все разумные меры по защите персональных данных Пользователей и соблюдает права субъектов персональных данных, установленные действующим законодательством Российской Федерации.<br/>
      Оформление заказа на Сайте и предоставление Пользователем своих персональных данных, в том числе через любые формы на сайте, администрации Сайта выражают согласие Пользователя на их обработку (понятие «обработка персональных данных» — согласно п.3 ст.3 ФЗ 152 «О персональных данных»).<br/>
      Обработка персональных данных осуществляется в целях исполнения Договора (Заказа Пользователя), исключительно на территории Российской Федерации, с соблюдением действующего законодательства РФ. Согласие дается на срок, определенный сроком исполнения Договора. В случае отзыва согласия на использование и обработку персональных данных Пользователя, Пользователь уведомляет об этом Администрацию Сайта письменно или по электронной почте. После получения данного уведомления Администрацией Сайта предоставление Пользователю услуг прекращается.<br/>
      Сайт не имеет статуса оператора персональных данных. Персональные данные Пользователя не передаются каким-либо третьим лицам, за исключением случаев, прямо предусмотренных настоящей Политикой конфиденциальности.
    </div>
  }
}